{
  "backend/main.mo": "Empty Motoko actor definition with no methods or state.",
  "feature_evidence.json": "Lists feature reports mapping app requirements to source files and components.",
  "frontend-file-summaries.txt": "Provides short descriptions of each frontend file’s purpose and role.",
  "frontend/index.css": "Tailwind base styles plus custom OKLCH color variables for light and dark themes.",
  "frontend/index.html": "Basic HTML page mounting the React app via root div and main.tsx script.",
  "frontend/src/App.tsx": "Main React component managing image upload, processing params, preview rendering, and UI layout.",
  "frontend/src/components/EnhancementControls.tsx": "UI card offering sliders for brightness, contrast, saturation, sharpen, and smoothing with apply/reset actions.",
  "frontend/src/components/ExportControls.tsx": "UI for choosing export format, JPEG quality, and downloading the processed image.",
  "frontend/src/components/ImageDropzone.tsx": "Drag‑and‑drop and file‑picker image upload component with validation and error handling.",
  "frontend/src/components/ImagePreview.tsx": "Displays a canvas-generated image preview with a loading overlay and shows metadata such as filename, size, dimensions, and format.",
  "frontend/src/components/ResizeControls.tsx": "Provides UI controls for adjusting image width, height, aspect ratio, and resize mode, updating processing parameters accordingly.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user's Internet Identity, refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements a React context for managing Internet Identity login, stored identities, and authentication state using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file indicating no backend queries are required for client‑side image processing.",
  "frontend/src/index.css": "Defines Tailwind CSS setup and custom color variables for light and dark themes.",
  "frontend/src/lib/exportImage.ts": "Exports a processed canvas image as a downloadable PNG or JPEG file with appropriate quality settings.",
  "frontend/src/lib/imageMetadata.ts": "Loads an image file to extract metadata such as dimensions, size, type, and returns an ImageMetadata object.",
  "frontend/src/lib/imageProcessing.ts": "Resizes an image and applies brightness, contrast, and saturation adjustments, returning a processed canvas.",
  "frontend/src/lib/types.ts": "Defines TypeScript interfaces for image metadata and processing parameters.",
  "frontend/src/main.tsx": "Initializes the React app, setting up React Query and Internet Identity providers before rendering the root component.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, typography, container settings, animations, and plugin integrations.",
  "project_state.json": "Defines the project's state, existing features, requirements, and metadata for a photo resizing and enhancement web app."
}